In [1]:
import pandas as pd
from google.colab import files
uploaded = files.upload()

ModuleNotFoundError: No module named 'google.colab'

In [1]:
import pandas as pd
df=pd.read_csv('student_marks.csv')

In [2]:
df

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [3]:
import datetime
dt=datetime.datetime.now()

In [4]:
dt

datetime.datetime(2024, 4, 16, 9, 41, 16, 65478)

In [5]:
df['DOB']=pd.to_datetime(df['DOB'])

C:\Users\admin\AppData\Local\Temp\ipykernel_9936\3174400515.py:1: UserWarning: Parsing '25-05-1989' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['DOB']=pd.to_datetime(df['DOB'])

In [6]:
df['DOB']

0   1988-05-04
1   1987-04-05
2   1989-05-25
3   1990-12-08
4   1989-02-09
5   1988-05-04
6   1987-04-05
7   1989-05-25
8   1990-12-08
9   1989-02-09
Name: DOB, dtype: datetime64[ns]

In [7]:
df['year']=df['DOB'].dt.year

In [8]:
df['year']

0    1988
1    1987
2    1989
3    1990
4    1989
5    1988
6    1987
7    1989
8    1990
9    1989
Name: year, dtype: int64

In [9]:
df.loc[4:]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53,1989
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52,1988
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61,1987
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87,1989
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89,1990
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77,1989

In [10]:
df.loc[2:,'DOB':]

,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year
2,1989-05-25,25,54,89,76,95,87,56,74,1989
3,1990-12-08,78,96,86,63,54,89,75,45,1990
4,1989-02-09,58,96,78,46,96,77,83,53,1989
5,1988-05-04,45,87,52,89,55,89,87,52,1988
6,1987-04-05,55,64,61,58,75,58,64,61,1987
7,1989-05-25,54,76,87,56,25,56,76,87,1989
8,1990-12-08,55,63,89,75,78,75,63,89,1990
9,1989-02-09,96,46,77,83,58,83,46,77,1989

In [11]:
df.loc[df['Gender']=='M','Name']
#adult_names = titanic.loc[titanic["Age"] > 35, "Name"]

0      John
1    Suresh
2    Ramesh
7    Ritesh
9    Mukesh
Name: Name, dtype: object

In [12]:
df.loc[df['Gender']=="F",["Gender","Name"]]

  Gender      Name
3      F   Jessica
4      F  Jennifer
5      F      Annu
6      F     pooja
8      F     Farha

In [13]:
df[(df["Gender"]=="M") & ( df["Name"]=="Mukesh")]
#df[(df['City']=='newyork')& (df['Salary']>50000)]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77,1989

In [14]:
df.loc[~((df["Gender"]=="M") &( df["Name"]=="Mukesh"))]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year
0,John,M,1988-05-04,55,45,56,87,21,52,89,65,1988
1,Suresh,M,1987-04-05,75,96,78,64,90,61,58,2,1987
2,Ramesh,M,1989-05-25,25,54,89,76,95,87,56,74,1989
3,Jessica,F,1990-12-08,78,96,86,63,54,89,75,45,1990
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53,1989
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52,1988
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61,1987
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87,1989
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89,1990

In [16]:
df['Name'].replace("John","Animesh")

0     Animesh
1      Suresh
2      Ramesh
3     Jessica
4    Jennifer
5        Annu
6       pooja
7      Ritesh
8       Farha
9      Mukesh
Name: Name, dtype: object

In [17]:
df['Total']=df['Maths']+df['Physics']+df['Chemistry']+df['English']+df['Biology']+df['Economics']+df['History']+df['Civics']

In [18]:
df['Total']

0    470
1    524
2    556
3    586
4    587
5    556
6    496
7    517
8    587
9    566
Name: Total, dtype: int64

In [20]:
#df.drop('grade',axis=1,inplace=True)

In [21]:
#df.drop('total',axis=1,inplace=True)

In [26]:
df['per']=(df['Total']/800)*100

In [27]:
df['per']

0    58.750
1    65.500
2    69.500
3    73.250
4    73.375
5    69.500
6    62.000
7    64.625
8    73.375
9    70.750
Name: per, dtype: float64

In [29]:
df.drop('grade',axis=1,inplace=True)

In [30]:
df

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year,Total,per
0,John,M,1988-05-04,55,45,56,87,21,52,89,65,1988,470,58.750
1,Suresh,M,1987-04-05,75,96,78,64,90,61,58,2,1987,524,65.500
2,Ramesh,M,1989-05-25,25,54,89,76,95,87,56,74,1989,556,69.500
3,Jessica,F,1990-12-08,78,96,86,63,54,89,75,45,1990,586,73.250
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53,1989,587,73.375
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52,1988,556,69.500
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61,1987,496,62.000
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87,1989,517,64.625
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89,1990,587,73.375
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77,1989,566,70.750

In [40]:
def getgrade(per):
    if per>90:
        return 'A'
    elif(per>=65 and per<70):
        return 'B'
    else:
        return 'C'
df['grade']=df['per'].apply(getgrade)
df

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year,Total,per,grade
0,John,M,1988-05-04,55,45,56,87,21,52,89,65,1988,470,58.750,C
1,Suresh,M,1987-04-05,75,96,78,64,90,61,58,2,1987,524,65.500,B
2,Ramesh,M,1989-05-25,25,54,89,76,95,87,56,74,1989,556,69.500,B
3,Jessica,F,1990-12-08,78,96,86,63,54,89,75,45,1990,586,73.250,C
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53,1989,587,73.375,C
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52,1988,556,69.500,B
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61,1987,496,62.000,C
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87,1989,517,64.625,C
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89,1990,587,73.375,C
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77,1989,566,70.750,C

In [40]:
grp=df.groupby('grade').count()
grp

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year,Total
grade,,,,,,,,,,,,,
c,10,10,10,10,10,10,10,10,10,10,10,10,10

In [46]:
grpmaths=df['Maths'].agg(['mean','max','min','count'])
grpmaths

mean     59.6
max      96.0
min      25.0
count    10.0
Name: Maths, dtype: float64

In [43]:
grpmaths=df['Maths'].min()
grpmaths

25

In [44]:
grpmaths=df['Maths'].max()
grpmaths

96

In [ ]:
df['males'].replace("John","abc",inplace=True)

In [ ]:
df.drop('males',axis=1)

In [ ]:
df

In [48]:
data1={'empid':list(range(1,6)),'empdept':['HR','admin','sales','CRM','IT']}
df2=pd.DataFrame(data1)

In [49]:
df2

   empid empdept
0      1      HR
1      2   admin
2      3   sales
3      4     CRM
4      5      IT

In [50]:
data2={'deptid':list(range(101,106)),'count':[20,50,60,30,10]}
df3=pd.DataFrame(data2)

In [51]:
pd.concat([df2,df3])

   empid empdept  deptid  count
0    1.0      HR     NaN    NaN
1    2.0   admin     NaN    NaN
2    3.0   sales     NaN    NaN
3    4.0     CRM     NaN    NaN
4    5.0      IT     NaN    NaN
0    NaN     NaN   101.0   20.0
1    NaN     NaN   102.0   50.0
2    NaN     NaN   103.0   60.0
3    NaN     NaN   104.0   30.0
4    NaN     NaN   105.0   10.0

In [52]:
pd.concat([df2,df3],ignore_index=True)

   empid empdept  deptid  count
0    1.0      HR     NaN    NaN
1    2.0   admin     NaN    NaN
2    3.0   sales     NaN    NaN
3    4.0     CRM     NaN    NaN
4    5.0      IT     NaN    NaN
5    NaN     NaN   101.0   20.0
6    NaN     NaN   102.0   50.0
7    NaN     NaN   103.0   60.0
8    NaN     NaN   104.0   30.0
9    NaN     NaN   105.0   10.0

In [45]:
df.describe()

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,year,Total,per
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000,10.000000,10.00000,10.000000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000,1988.600000,544.50000,68.062500
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432,1.074968,41.01558,5.126947
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000,1987.000000,470.00000,58.750000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500,1988.000000,518.75000,64.843750
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000,1989.000000,556.00000,69.500000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500,1989.000000,581.00000,72.625000
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000,1990.000000,587.00000,73.375000

In [54]:
df=pd.DataFrame([{'a':'xyz',
                  'b': 'lmn'}])
df

     a    b
0  xyz  lmn

In [56]:
df.dtypes

a    object
b    object
dtype: object

In [57]:
df.size

2

In [58]:
df.shape

(1, 2)

In [59]:
df.T

     0
a  xyz
b  lmn

In [60]:
df.index

RangeIndex(start=0, stop=1, step=1)

In [61]:
df.values

array([['xyz', 'lmn']], dtype=object)

In [62]:
df.axes

[RangeIndex(start=0, stop=1, step=1), Index(['a', 'b'], dtype='object')]

In [63]:
df.ndim

2

In [64]:
df['a']

0    xyz
Name: a, dtype: object

In [65]:
df

     a    b
0  xyz  lmn

In [71]:
df['a']="Akanksha"

In [72]:
df

          a    b       df
0  Akanksha  lmn  Aknksha

In [74]:
df[['a','b']]

          a    b
0  Akanksha  lmn